In [1]:
import pandas as pd
import numpy as np 
import sqlite3

In [2]:
conn = sqlite3.connect('avocado.db')

In [3]:
cur = conn.cursor()
avo = cur.execute("""
  select * from avocado;"""
).fetchall()

In [4]:
df = pd.DataFrame(data=avo)

In [5]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [6]:
colnames = cur.description
for row in colnames:
    print (row[0])

field1
Date
AveragePrice
TotalVolume
4046
4225
4770
TotalBags
SmallBags
LargeBags
XLargeBags
type
year
region

In [7]:
Frame=pd.DataFrame(avo, columns = ["field1", "Date", "AveragePrice", "TotalPrice","4046","4225","4770","TotalBags","SmallBags",
                                  "LargeBags","XLargeBags","type","year","region"])

In [8]:
Frame.head()

,field1,Date,AveragePrice,TotalPrice,4046,4225,4770,TotalBags,SmallBags,LargeBags,XLargeBags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [9]:
conn2 = sqlite3.connect('avocado.db')

In [10]:
conn2 = sqlite3.connect('avocado.db')
cur2 = conn2.cursor()
avo2 = cur2.execute("""
  Select * from 
(
SELECT 
REGION, 
AVG(AVERAGEPRICE) AS AVG_REGION_PRICE,
MIN(AVERAGEPRICE) AS MIN_REGION_PRICE,
MAX(AVERAGEPRICE) AS MAX_REGION_PRICE
FROM AVOCADO
GROUP BY REGION
ORDER BY AVG(AVERAGEPRICE) DESC
LIMIT 1
)

UNION

SELECT 
REGION, 
AVG(AVERAGEPRICE) AS AVG_REGION_PRICE,
MIN(AVERAGEPRICE) AS MIN_REGION_PRICE,
MAX(AVERAGEPRICE) AS MAX_REGION_PRICE
FROM AVOCADO
WHERE REGION = 'Louisville'
GROUP BY REGION
ORDER BY AVG(AVERAGEPRICE) DESC
;"""
).fetchall()

In [11]:
df2 = pd.DataFrame(data=avo2)

In [12]:
df2.head()

                     0         1     2     3
0  HartfordSpringfield  1.818639  0.86  2.68
1           Louisville  1.286686  0.56  2.29

In [13]:
colnames2 = cur2.description
for row in colnames2:
    print (row[0])

REGION
AVG_REGION_PRICE
MIN_REGION_PRICE
MAX_REGION_PRICE

In [14]:
Frame2=pd.DataFrame(avo2, columns = ["REGION", "AVG_REGION_PRICE", "MIN_REGION_PRICE","MAX_REGION_PRICE"])

In [15]:
Frame2.head()

                REGION  AVG_REGION_PRICE  MIN_REGION_PRICE  MAX_REGION_PRICE
0  HartfordSpringfield          1.818639              0.86              2.68
1           Louisville          1.286686              0.56              2.29

In [ ]:
#######Works to this point########